{
  "irVersion": "1.0",
  "project": "assistantkit",
  "repository": "https://github.com/agentplexus/assistantkit",
  "versioning": "semver",
  "commitConvention": "conventional",
  "maintainers": ["agentplexus"],
  "releases": [
    {
      "version": "v0.10.0",
      "date": "2026-02-14",
      "highlights": [
        { "description": "New `validate` command for specs directory validation before generation" },
        { "description": "Kiro CLI integration improvements with usage documentation and prefix support" }
      ],
      "added": [
        { "description": "`assistantkit validate` command for pre-generation validation of specs directories", "commit": "0e66a0d" },
        { "description": "`generate.Validate()` function returning `ValidateResult` with checks, errors, and warnings", "commit": "0e66a0d" },
        { "description": "Kiro CLI usage examples in generated README with coordinator detection", "commit": "17a53a9" },
        { "description": "Installation section in generated Kiro README for kiro-cli setup", "commit": "17a53a9" }
      ],
      "fixed": [
        { "description": "Kiro steering file names now correctly apply prefix from deployment config", "commit": "878625d" },
        { "description": "`KiroTargetConfig` with `Prefix` field and `DeploymentTarget.ParseKiroConfig()` method", "commit": "878625d" },
        { "description": "Kiro agent tool mapping now includes `execute_bash`, `fs_read`, `fs_write`", "commit": "cebcb40" }
      ],
      "documentation": [
        { "description": "Added enhancement proposal for validate and test commands", "commit": "1aff391" }
      ],
      "dependencies": [
        { "description": "Upgraded `gogithub` v0.8.0 → v0.9.0", "commit": "2939278" }
      ]
    },
    {
      "version": "v0.9.0",
      "date": "2026-02-02",
      "highlights": [
        { "description": "Unified specs/ directory with deployment-driven plugin generation" },
        { "description": "Single 'assistantkit generate' command replaces separate subcommands" }
      ],
      "added": [
        { "description": "`Generate()` function for unified deployment-driven plugin generation from specs/", "commit": "b2d8fb1" },
        { "description": "`generatePlatformPlugin()` helper for per-platform complete plugin generation", "commit": "b2d8fb1" },
        { "description": "Main `generate` command now runnable with `--specs`, `--target`, `--output` flags", "commit": "679e6dd" }
      ],
      "changed": [
        { "description": "`loadAgents()` now uses `agents.ReadCanonicalDir()` supporting both `.md` and `.json` files", "commit": "b2d8fb1" },
        { "description": "Each deployment target now receives complete plugin (agents, commands, skills, manifest)", "commit": "b2d8fb1" }
      ],
      "deprecated": [
        { "description": "`generate plugins` subcommand - use `generate --specs=... --target=...` instead", "commit": "679e6dd" },
        { "description": "`generate agents` subcommand - use `generate --specs=... --target=...` instead", "commit": "679e6dd" },
        { "description": "`generate all` subcommand - use `generate --specs=... --target=...` instead", "commit": "679e6dd" },
        { "description": "`generate deployment` subcommand - use `generate --specs=... --target=...` instead", "commit": "679e6dd" }
      ],
      "documentation": [
        { "description": "Updated README CLI section for unified generate workflow", "commit": "88e7399" },
        { "description": "Updated CLAUDE.md with generate package and CLI workflow sections", "commit": "88e7399" }
      ],
      "dependencies": [
        { "description": "Upgraded `go-github` v81 → v82", "commit": "90aecb4" }
      ]
    },
    {
      "version": "v0.8.0",
      "date": "2026-01-25",
      "highlights": [
        { "description": "Simplified agent generation with 'generate agents' and 'generate all' commands" },
        { "description": "Markdown command file support with YAML frontmatter" }
      ],
      "added": [
        { "description": "`generate agents` command for simplified multi-agent-spec workflow", "commit": "2f5db70" },
        { "description": "`generate all` command combining plugins and agents generation", "commit": "2f5db70" },
        { "description": "Markdown command file support with YAML frontmatter in `commands/core`", "commit": "42abcd7" },
        { "description": "Auto-detection of command file format (.md vs .json)", "commit": "42abcd7" },
        { "description": "CLI dependency checking with HITL prompts in `requirements`", "commit": "1be8e02" }
      ],
      "documentation": [
        { "description": "Added 'generate agents' command documentation to README", "commit": "b9a9a39" }
      ],
      "dependencies": [
        { "description": "Upgraded `multi-agent-spec/sdk/go` v0.4.0 → v0.5.0", "commit": "aa4e40a" }
      ]
    },
    {
      "version": "v0.7.0",
      "date": "2026-01-24",
      "highlights": [
        { "description": "Adopt multi-agent-spec SDK as canonical agent model with new powers, skills/kiro, and CLI packages" }
      ],
      "added": [
        { "description": "`powers` package with canonical Power type and Kiro IDE power generation (POWER.md, mcp.json, steering files)", "commit": "48a5262" },
        { "description": "`skills/kiro` adapter for generating Kiro steering files from canonical skills", "commit": "b56063d" },
        { "description": "Markdown skill format with YAML frontmatter in `skills/core`", "commit": "b56063d" },
        { "description": "`generate` package for programmatic plugin and deployment generation (Claude, Kiro, Gemini)", "commit": "f5df2a5" },
        { "description": "`cmd/assistantkit` CLI with `generate plugins` and `generate deployment` subcommands", "commit": "22d3d57" },
        { "description": "`genagents` CLI: `--skills`/`--skills-output` flags for steering file generation", "commit": "d204e70" },
        { "description": "`genagents` CLI: `--install` flag to copy agents and skills to `~/.kiro/`", "commit": "d204e70" },
        { "description": "Model type constants: `ModelHaiku`, `ModelSonnet`, `ModelOpus`", "commit": "458c974" }
      ],
      "changed": [
        { "description": "**BREAKING:** `Agent` struct replaced with type alias to `multiagentspec.Agent`; setter methods removed in favor of builder pattern", "commit": "458c974" },
        { "description": "**BREAKING:** `Agent.Model` field type changed from `string` to `Model` (type alias to `multiagentspec.Model`)", "commit": "458c974" },
        { "description": "Kiro agent adapter uses actual tool names (`execute_bash`, `fs_read`, `fs_write`) with deduplication", "commit": "458c974" }
      ],
      "documentation": [
        { "description": "Added CLI reference documentation for `generate plugins` command", "commit": "67bfa39" },
        { "description": "Updated README with CLI install and usage sections", "commit": "67bfa39" },
        { "description": "Added v0.7.0 release notes", "commit": "054a744" }
      ],
      "tests": [
        { "description": "Updated agent tests for Model type and builder-style API", "commit": "026fcfc" },
        { "description": "Updated Kiro adapter tests for new tool names and deduplication", "commit": "026fcfc" }
      ],
      "dependencies": [
        { "description": "Upgraded `multi-agent-spec/sdk/go` v0.3.0 → v0.4.0", "commit": "840400b" },
        { "description": "Added `github.com/spf13/cobra` v1.10.2 for CLI framework", "commit": "840400b" }
      ]
    },
    {
      "version": "v0.6.0",
      "date": "2026-01-18",
      "highlights": [
        { "description": "Unified bundle generation package for multi-tool plugin output" }
      ],
      "added": [
        { "description": "`bundle` package for unified plugin bundle generation across tools (Claude, Kiro, Gemini, Cursor, Codex, VS Code)", "commit": "7419d87" },
        { "description": "`bundle.New()`, `Generate()`, `GenerateAll()` methods for creating and outputting bundles", "commit": "7419d87" },
        { "description": "Consolidated plugin.json format for Claude with embedded MCP servers and hooks", "commit": "7419d87" },
        { "description": "`MCPServerConfig`, `HooksConfig`, `HookEntry`, `Hook` types in `plugins/claude`", "commit": "885b084" }
      ],
      "changed": [
        { "description": "**BREAKING:** `ClaudePlugin.Hooks` field type changed from `string` to `*HooksConfig`", "commit": "885b084" },
        { "description": "`ClaudePlugin` now supports embedded `MCPServers` map for consolidated config", "commit": "885b084" },
        { "description": "`ToCanonical()` and `FromCanonical()` updated to convert MCP servers", "commit": "885b084" }
      ],
      "documentation": [
        { "description": "Updated Claude marketplace docs with bundle API examples and consolidated format", "commit": "fecbd4c" }
      ],
      "tests": [
        { "description": "Added unit tests for bundle package (New, AddComponents, Generate, GenerateAll)", "commit": "aeb9962" }
      ],
      "dependencies": [
        { "description": "Updated `multi-agent-spec/sdk/go` v0.1.0 → v0.3.0", "commit": "aa28c70" },
        { "description": "Updated `gogithub` v0.5.0 → v0.6.0", "commit": "aa28c70" }
      ]
    },
    {
      "version": "v0.5.0",
      "date": "2026-01-18",
      "highlights": [
        { "description": "Module renamed from aiassistkit to assistantkit" }
      ],
      "changed": [
        { "description": "**BREAKING:** Module path renamed from `github.com/agentplexus/aiassistkit` to `github.com/agentplexus/assistantkit`", "commit": "2232018" },
        { "description": "Package name renamed from `aiassistkit` to `assistantkit`", "commit": "2232018" },
        { "description": "Main source file renamed from `aiassistkit.go` to `assistantkit.go`", "commit": "2232018" }
      ],
      "documentation": [
        { "description": "Updated documentation for assistantkit rename", "commit": "3bdf058" },
        { "description": "Added v0.5.0 release notes with migration guide", "commit": "01c2124" }
      ]
    },
    {
      "version": "v0.4.0",
      "date": "2026-01-17",
      "highlights": [
        { "description": "Migration to agentplexus organization with hooks package for AI assistant lifecycle events" }
      ],
      "added": [
        { "description": "`hooks` package with adapters for AI assistant lifecycle hooks (Claude, Cursor, Windsurf)", "commit": "e7155b9" },
        { "description": "`hooks/core` with canonical hook types, events, and adapter interface", "commit": "e7155b9" },
        { "description": "`hooks/claude` adapter for Claude Code hooks (PreToolUse, PostToolUse, etc.)", "commit": "e7155b9" },
        { "description": "`hooks/cursor` adapter for Cursor IDE hooks", "commit": "e7155b9" },
        { "description": "`hooks/windsurf` adapter for Windsurf hooks", "commit": "e7155b9" }
      ],
      "changed": [
        { "description": "Module path changed from `github.com/grokify/aiassistkit` to `github.com/agentplexus/assistantkit`", "commit": "35abed5" }
      ],
      "documentation": [
        { "description": "Updated documentation for agentplexus migration", "commit": "f02d4da" },
        { "description": "Added v0.4.0 release notes", "commit": "f02d4da" }
      ],
      "dependencies": [
        { "description": "Added `github.com/agentplexus/multi-agent-spec/sdk/go` for multi-agent specifications", "commit": "9a7c9c7" }
      ]
    },
    {
      "version": "v0.3.0",
      "date": "2026-01-17",
      "highlights": [
        { "description": "Automated marketplace publishing with GitHub PR creation" }
      ],
      "added": [
        { "description": "`publish` package for automated plugin submission to AI assistant marketplaces", "commit": "f51322d" },
        { "description": "`publish/claude` adapter for Claude Code marketplace (anthropics/claude-plugins-official)", "commit": "f51322d" },
        { "description": "`publish/github` client wrapper using gogithub for GitHub API operations", "commit": "f51322d" }
      ],
      "dependencies": [
        { "description": "Added `github.com/grokify/gogithub` v0.5.0 for GitHub API utilities", "commit": "f51322d" },
        { "description": "Added `github.com/google/go-github/v81` for GitHub API client", "commit": "f51322d" }
      ]
    },
    {
      "version": "v0.2.0",
      "date": "2026-01-17",
      "highlights": [
        { "description": "Multi-platform agent generation with new AWS adapters and genagents CLI" }
      ],
      "added": [
        { "description": "`agents/agentkit` adapter for AWS AgentKit/Agent Builder JSON format", "commit": "d49e2f5" },
        { "description": "`agents/awsagentcore` adapter for AWS CDK TypeScript code generation", "commit": "d49e2f5" },
        { "description": "`cmd/genagents` CLI for multi-platform agent generation from canonical specs", "commit": "5bcd07e" }
      ],
      "documentation": [
        { "description": "Comprehensive MkDocs documentation site with Material theme", "commit": "2ca28b3" },
        { "description": "Release notes section with v0.1.0 and v0.2.0 notes", "commit": "ab6ec4e" }
      ],
      "infrastructure": [
        { "description": "GitHub Actions workflow for MkDocs gh-pages deployment", "commit": "70d0053" }
      ]
    },
    {
      "version": "v0.1.0",
      "date": "2026-01-12",
      "highlights": [
        { "description": "Initial release with unified configuration management for AI coding assistants supporting 9 tools" }
      ],
      "added": [
        { "description": "`mcp` package with adapters for MCP server configurations (Claude, Cursor, Windsurf, VS Code, Codex, Cline, Roo, Kiro)", "commit": "ae9f762" },
        { "description": "`context` package with converter for generating CLAUDE.md from CONTEXT.json", "commit": "50bacd7" },
        { "description": "`agents` package with adapters for AI assistant agent definitions (Claude, Codex, Gemini, Kiro)", "commit": "b62c572" },
        { "description": "`commands` package with adapters for slash command definitions (Claude, Codex, Gemini)", "commit": "7578daf" },
        { "description": "`plugins` package with adapters for plugin/extension configurations (Claude, Gemini)", "commit": "76ba9cf" },
        { "description": "`skills` package with adapters for reusable skill definitions (Claude, Codex)", "commit": "e532fc1" },
        { "description": "`teams` package for multi-agent team orchestration with process types (sequential, parallel, hierarchical)", "commit": "5c75117" },
        { "description": "`validation` package with configuration validators (Claude, Codex, Gemini)", "commit": "95ec174" },
        { "description": "Adapter pattern with canonical types and tool-specific converters", "commit": "ae9f762" },
        { "description": "Self-registering adapters via `init()` for automatic discovery", "commit": "ae9f762" },
        { "description": "JSON Schema validation for plugins, commands, skills, agents, teams, and validation configs", "commit": "95ec174" }
      ],
      "documentation": [
        { "description": "PRD.md product requirements document", "commit": "a741e66" },
        { "description": "TRD.md technical requirements document", "commit": "a741e66" },
        { "description": "ROADMAP.md and ROADMAP.json for project planning", "commit": "a741e66" },
        { "description": "README.md with installation and usage examples", "commit": "a741e66" },
        { "description": "PRESENTATION.md Marp slides for project overview", "commit": "a741e66" }
      ]
    }
  ]
}
