{
  "ir_version": "1.0",
  "project": "AI Assist Kit",
  "repository": "https://github.com/plexusone/assistantkit",

  "legend": {
    "completed": {"emoji": "✅", "description": "Completed"},
    "in_progress": {"emoji": "🚧", "description": "In Progress"},
    "planned": {"emoji": "📋", "description": "Planned"},
    "future": {"emoji": "💡", "description": "Under Consideration"}
  },

  "areas": [
    {"id": "core", "name": "Core", "priority": 1},
    {"id": "config", "name": "Configuration", "priority": 2},
    {"id": "plugins", "name": "Plugins & Extensions", "priority": 3},
    {"id": "tools", "name": "Tools & Adapters", "priority": 4}
  ],

  "phases": [
    {
      "id": "v0.1",
      "name": "v0.1.0 - Foundation",
      "status": "completed",
      "order": 1,
      "description": "Initial release with MCP and Hooks support"
    },
    {
      "id": "v0.2",
      "name": "v0.2.0 - Plugins & Commands",
      "status": "completed",
      "order": 2,
      "description": "Add plugin manifests and command definitions"
    },
    {
      "id": "v0.3",
      "name": "v0.3.0 - Marketplace Publishing",
      "status": "completed",
      "order": 3,
      "description": "Automated marketplace publishing with GitHub PR creation"
    },
    {
      "id": "v0.4",
      "name": "v0.4.0 - Hooks & Organization",
      "status": "completed",
      "order": 4,
      "description": "Hooks package and migration to agentplexus organization"
    },
    {
      "id": "v0.5",
      "name": "v0.5.0 - Rename",
      "status": "completed",
      "order": 5,
      "description": "Module renamed from aiassistkit to assistantkit"
    },
    {
      "id": "v0.6",
      "name": "v0.6.0 - Bundle Generation",
      "status": "completed",
      "order": 6,
      "description": "Unified bundle generation for multi-tool plugin output"
    },
    {
      "id": "v0.7",
      "name": "v0.7.0 - Settings & Rules",
      "status": "planned",
      "order": 7,
      "description": "Add settings and rules configurations"
    },
    {
      "id": "v1.0",
      "name": "v1.0.0 - General Availability",
      "status": "planned",
      "order": 8,
      "description": "Production-ready release with full feature set"
    },
    {
      "id": "future",
      "name": "Future",
      "status": "future",
      "order": 99,
      "description": "Post v1.0 enhancements"
    }
  ],

  "items": [
    {
      "id": "mcp-core",
      "title": "MCP core types",
      "description": "Canonical Config, Server, Transport types for MCP",
      "status": "completed",
      "version": "0.1.0",
      "phase": "v0.1",
      "area": "config",
      "type": "Added",
      "priority": "high"
    },
    {
      "id": "mcp-claude",
      "title": "Claude MCP adapter",
      "description": "Claude Code / Claude Desktop .mcp.json support",
      "status": "completed",
      "version": "0.1.0",
      "phase": "v0.1",
      "area": "tools",
      "type": "Added",
      "priority": "high"
    },
    {
      "id": "mcp-cursor",
      "title": "Cursor MCP adapter",
      "description": "Cursor IDE ~/.cursor/mcp.json support",
      "status": "completed",
      "version": "0.1.0",
      "phase": "v0.1",
      "area": "tools",
      "type": "Added",
      "priority": "high"
    },
    {
      "id": "mcp-windsurf",
      "title": "Windsurf MCP adapter",
      "description": "Windsurf/Codeium mcp_config.json support",
      "status": "completed",
      "version": "0.1.0",
      "phase": "v0.1",
      "area": "tools",
      "type": "Added",
      "priority": "high"
    },
    {
      "id": "mcp-vscode",
      "title": "VS Code MCP adapter",
      "description": "VS Code / GitHub Copilot mcp.json support",
      "status": "completed",
      "version": "0.1.0",
      "phase": "v0.1",
      "area": "tools",
      "type": "Added",
      "priority": "high"
    },
    {
      "id": "mcp-codex",
      "title": "Codex MCP adapter",
      "description": "OpenAI Codex CLI config.toml (TOML) support",
      "status": "completed",
      "version": "0.1.0",
      "phase": "v0.1",
      "area": "tools",
      "type": "Added",
      "priority": "high"
    },
    {
      "id": "mcp-cline",
      "title": "Cline MCP adapter",
      "description": "Cline VS Code extension support",
      "status": "completed",
      "version": "0.1.0",
      "phase": "v0.1",
      "area": "tools",
      "type": "Added",
      "priority": "medium"
    },
    {
      "id": "mcp-roo",
      "title": "Roo Code MCP adapter",
      "description": "Roo Code VS Code extension support",
      "status": "completed",
      "version": "0.1.0",
      "phase": "v0.1",
      "area": "tools",
      "type": "Added",
      "priority": "medium"
    },
    {
      "id": "mcp-kiro",
      "title": "AWS Kiro MCP adapter",
      "description": "AWS Kiro CLI support",
      "status": "completed",
      "version": "0.1.0",
      "phase": "v0.1",
      "area": "tools",
      "type": "Added",
      "priority": "medium"
    },
    {
      "id": "hooks-core",
      "title": "Hooks core types",
      "description": "Canonical Config, Hook, Event types for lifecycle hooks",
      "status": "completed",
      "version": "0.1.0",
      "phase": "v0.1",
      "area": "config",
      "type": "Added",
      "priority": "high"
    },
    {
      "id": "hooks-claude",
      "title": "Claude hooks adapter",
      "description": "Claude Code .claude/settings.json hooks support",
      "status": "completed",
      "version": "0.1.0",
      "phase": "v0.1",
      "area": "tools",
      "type": "Added",
      "priority": "high"
    },
    {
      "id": "hooks-cursor",
      "title": "Cursor hooks adapter",
      "description": "Cursor IDE .cursor/hooks.json support",
      "status": "completed",
      "version": "0.1.0",
      "phase": "v0.1",
      "area": "tools",
      "type": "Added",
      "priority": "high"
    },
    {
      "id": "hooks-windsurf",
      "title": "Windsurf hooks adapter",
      "description": "Windsurf .windsurf/hooks.json support",
      "status": "completed",
      "version": "0.1.0",
      "phase": "v0.1",
      "area": "tools",
      "type": "Added",
      "priority": "high"
    },
    {
      "id": "context-core",
      "title": "Context core types",
      "description": "Canonical Context, Architecture, Package types",
      "status": "completed",
      "version": "0.1.0",
      "phase": "v0.1",
      "area": "config",
      "type": "Added",
      "priority": "high"
    },
    {
      "id": "context-claude",
      "title": "Claude context converter",
      "description": "CONTEXT.json to CLAUDE.md converter",
      "status": "completed",
      "version": "0.1.0",
      "phase": "v0.1",
      "area": "tools",
      "type": "Added",
      "priority": "high"
    },
    {
      "id": "context-schema",
      "title": "Context JSON Schema",
      "description": "project-context.schema.json for validation",
      "status": "completed",
      "version": "0.1.0",
      "phase": "v0.1",
      "area": "core",
      "type": "Added",
      "priority": "medium"
    },
    {
      "id": "plugins-core",
      "title": "Plugin core types",
      "description": "Canonical Plugin struct for manifests",
      "status": "in_progress",
      "version": "0.2.0",
      "phase": "v0.2",
      "area": "plugins",
      "type": "Added",
      "priority": "high"
    },
    {
      "id": "plugins-schema",
      "title": "Plugin JSON Schema",
      "description": "plugin.schema.json for validation",
      "status": "planned",
      "version": "0.2.0",
      "phase": "v0.2",
      "area": "plugins",
      "type": "Added",
      "priority": "high"
    },
    {
      "id": "plugins-claude",
      "title": "Claude plugin adapter",
      "description": "Generate .claude-plugin/plugin.json",
      "status": "planned",
      "version": "0.2.0",
      "phase": "v0.2",
      "area": "plugins",
      "type": "Added",
      "priority": "high"
    },
    {
      "id": "plugins-gemini",
      "title": "Gemini extension adapter",
      "description": "Generate gemini-extension.json",
      "status": "planned",
      "version": "0.2.0",
      "phase": "v0.2",
      "area": "plugins",
      "type": "Added",
      "priority": "high"
    },
    {
      "id": "commands-core",
      "title": "Command core types",
      "description": "Canonical Command struct for prompts/commands",
      "status": "planned",
      "version": "0.2.0",
      "phase": "v0.2",
      "area": "plugins",
      "type": "Added",
      "priority": "high"
    },
    {
      "id": "commands-schema",
      "title": "Command JSON Schema",
      "description": "command.schema.json for validation",
      "status": "planned",
      "version": "0.2.0",
      "phase": "v0.2",
      "area": "plugins",
      "type": "Added",
      "priority": "high"
    },
    {
      "id": "commands-claude",
      "title": "Claude command adapter",
      "description": "Generate commands/*.md (Markdown + YAML)",
      "status": "planned",
      "version": "0.2.0",
      "phase": "v0.2",
      "area": "plugins",
      "type": "Added",
      "priority": "high"
    },
    {
      "id": "commands-gemini",
      "title": "Gemini command adapter",
      "description": "Generate commands/*.toml (TOML)",
      "status": "planned",
      "version": "0.2.0",
      "phase": "v0.2",
      "area": "plugins",
      "type": "Added",
      "priority": "high"
    },
    {
      "id": "commands-codex",
      "title": "Codex prompt adapter",
      "description": "Generate prompts/*.md (Markdown + YAML)",
      "status": "planned",
      "version": "0.2.0",
      "phase": "v0.2",
      "area": "plugins",
      "type": "Added",
      "priority": "high"
    },
    {
      "id": "skills-core",
      "title": "Skill core types",
      "description": "Canonical Skill struct for skills",
      "status": "planned",
      "version": "0.3.0",
      "phase": "v0.3",
      "area": "plugins",
      "type": "Added",
      "priority": "high"
    },
    {
      "id": "skills-schema",
      "title": "Skill JSON Schema",
      "description": "skill.schema.json for validation",
      "status": "planned",
      "version": "0.3.0",
      "phase": "v0.3",
      "area": "plugins",
      "type": "Added",
      "priority": "high"
    },
    {
      "id": "skills-claude",
      "title": "Claude skill adapter",
      "description": "Generate skills/*/SKILL.md",
      "status": "planned",
      "version": "0.3.0",
      "phase": "v0.3",
      "area": "plugins",
      "type": "Added",
      "priority": "high"
    },
    {
      "id": "skills-codex",
      "title": "Codex skill adapter",
      "description": "Generate skills/*/SKILL.md",
      "status": "planned",
      "version": "0.3.0",
      "phase": "v0.3",
      "area": "plugins",
      "type": "Added",
      "priority": "high"
    },
    {
      "id": "agents-core",
      "title": "Agent core types",
      "description": "Canonical Agent struct for agent definitions",
      "status": "planned",
      "version": "0.3.0",
      "phase": "v0.3",
      "area": "plugins",
      "type": "Added",
      "priority": "high"
    },
    {
      "id": "agents-parser",
      "title": "Agent Markdown+YAML parser",
      "description": "Parse Markdown files with YAML frontmatter to Agent struct",
      "status": "planned",
      "version": "0.3.0",
      "phase": "v0.3",
      "area": "plugins",
      "type": "Added",
      "priority": "high",
      "depends_on": ["agents-core"]
    },
    {
      "id": "agents-schema",
      "title": "Agent JSON Schema",
      "description": "agent.schema.json for validation",
      "status": "planned",
      "version": "0.3.0",
      "phase": "v0.3",
      "area": "plugins",
      "type": "Added",
      "priority": "high",
      "depends_on": ["agents-core"]
    },
    {
      "id": "agents-claude",
      "title": "Claude Code agent adapter",
      "description": "Generate agents/*.md for Claude Code",
      "status": "planned",
      "version": "0.3.0",
      "phase": "v0.3",
      "area": "plugins",
      "type": "Added",
      "priority": "high",
      "depends_on": ["agents-parser"]
    },
    {
      "id": "agents-gemini",
      "title": "Gemini CLI agent adapter",
      "description": "Generate agent definitions for Gemini CLI",
      "status": "planned",
      "version": "0.3.0",
      "phase": "v0.3",
      "area": "plugins",
      "type": "Added",
      "priority": "high",
      "depends_on": ["agents-parser"]
    },
    {
      "id": "agents-codex",
      "title": "Codex CLI agent adapter",
      "description": "Generate agent definitions for OpenAI Codex CLI",
      "status": "planned",
      "version": "0.3.0",
      "phase": "v0.3",
      "area": "plugins",
      "type": "Added",
      "priority": "high",
      "depends_on": ["agents-parser"]
    },
    {
      "id": "agents-kiro",
      "title": "Kiro CLI agent adapter",
      "description": "Generate agent definitions for AWS Kiro CLI",
      "status": "planned",
      "version": "0.3.0",
      "phase": "v0.3",
      "area": "plugins",
      "type": "Added",
      "priority": "high",
      "depends_on": ["agents-parser"]
    },
    {
      "id": "context-gemini",
      "title": "Gemini context converter",
      "description": "CONTEXT.json to GEMINI.md converter",
      "status": "planned",
      "version": "0.3.0",
      "phase": "v0.3",
      "area": "tools",
      "type": "Added",
      "priority": "medium"
    },
    {
      "id": "context-codex",
      "title": "Codex context converter",
      "description": "CONTEXT.json to AGENTS.md converter",
      "status": "planned",
      "version": "0.3.0",
      "phase": "v0.3",
      "area": "tools",
      "type": "Added",
      "priority": "medium"
    },
    {
      "id": "bundle-core",
      "title": "Bundle core types",
      "description": "Unified Bundle struct combining all plugin components",
      "status": "completed",
      "version": "0.6.0",
      "phase": "v0.6",
      "area": "core",
      "type": "Added",
      "priority": "high"
    },
    {
      "id": "bundle-generate",
      "title": "Bundle generation",
      "description": "Generate() and GenerateAll() for multi-tool output",
      "status": "completed",
      "version": "0.6.0",
      "phase": "v0.6",
      "area": "core",
      "type": "Added",
      "priority": "high",
      "depends_on": ["bundle-core"]
    },
    {
      "id": "bundle-consolidated",
      "title": "Consolidated plugin.json",
      "description": "Claude plugin.json with embedded MCP servers and hooks",
      "status": "completed",
      "version": "0.6.0",
      "phase": "v0.6",
      "area": "plugins",
      "type": "Added",
      "priority": "high",
      "depends_on": ["bundle-generate"]
    },
    {
      "id": "settings-core",
      "title": "Settings core types",
      "description": "Canonical Settings struct for permissions/sandbox",
      "status": "planned",
      "version": "0.7.0",
      "phase": "v0.7",
      "area": "config",
      "type": "Added",
      "priority": "medium"
    },
    {
      "id": "settings-claude",
      "title": "Claude settings adapter",
      "description": "Claude Code settings.json support",
      "status": "planned",
      "version": "0.7.0",
      "phase": "v0.7",
      "area": "tools",
      "type": "Added",
      "priority": "medium"
    },
    {
      "id": "rules-core",
      "title": "Rules core types",
      "description": "Canonical Rules struct for coding guidelines",
      "status": "planned",
      "version": "0.7.0",
      "phase": "v0.7",
      "area": "config",
      "type": "Added",
      "priority": "medium"
    },
    {
      "id": "rules-cursor",
      "title": "Cursor rules adapter",
      "description": ".cursorrules generation",
      "status": "planned",
      "version": "0.7.0",
      "phase": "v0.7",
      "area": "tools",
      "type": "Added",
      "priority": "medium"
    },
    {
      "id": "rules-copilot",
      "title": "Copilot instructions adapter",
      "description": ".github/copilot-instructions.md generation",
      "status": "planned",
      "version": "0.7.0",
      "phase": "v0.7",
      "area": "tools",
      "type": "Added",
      "priority": "medium"
    },
    {
      "id": "cli-generate",
      "title": "CLI generate command",
      "description": "aiassistkit generate for multi-tool output",
      "status": "planned",
      "version": "1.0.0",
      "phase": "v1.0",
      "area": "core",
      "type": "Added",
      "priority": "high"
    },
    {
      "id": "cli-validate",
      "title": "CLI validate command",
      "description": "aiassistkit validate for schema validation",
      "status": "planned",
      "version": "1.0.0",
      "phase": "v1.0",
      "area": "core",
      "type": "Added",
      "priority": "high"
    },
    {
      "id": "cli-convert",
      "title": "CLI convert command",
      "description": "aiassistkit convert for format conversion",
      "status": "planned",
      "version": "1.0.0",
      "phase": "v1.0",
      "area": "core",
      "type": "Added",
      "priority": "high"
    },
    {
      "id": "aider-support",
      "title": "Aider support",
      "description": "Aider AI coding assistant adapters",
      "status": "future",
      "phase": "future",
      "area": "tools",
      "type": "Added",
      "priority": "medium"
    },
    {
      "id": "continue-support",
      "title": "Continue support",
      "description": "Continue VS Code extension adapters",
      "status": "future",
      "phase": "future",
      "area": "tools",
      "type": "Added",
      "priority": "medium"
    },
    {
      "id": "avante-support",
      "title": "Avante support",
      "description": "Avante Neovim plugin adapters",
      "status": "future",
      "phase": "future",
      "area": "tools",
      "type": "Added",
      "priority": "low"
    }
  ],

  "sections": [
    {
      "id": "overview",
      "title": "Overview",
      "order": 1,
      "content": [
        {"type": "text", "value": "AI Assist Kit provides a unified Go library for managing configuration files across multiple AI coding assistants. It enables define-once, generate-everywhere workflows through canonical types and tool-specific adapters."}
      ]
    },
    {
      "id": "references",
      "title": "References",
      "order": 99,
      "content": [
        {"type": "list", "items": [
          "[PRD.md](PRD.md) - Product requirements",
          "[TRD.md](TRD.md) - Technical requirements",
          "[README.md](README.md) - User documentation"
        ]}
      ]
    }
  ],

  "version_history": [
    {"version": "0.1.0", "date": "2026-01-12", "status": "completed", "summary": "MCP, Hooks, Context support"},
    {"version": "0.2.0", "date": "2026-01-17", "status": "completed", "summary": "Plugins and Commands with genagents CLI"},
    {"version": "0.3.0", "date": "2026-01-17", "status": "completed", "summary": "Marketplace publishing with GitHub PR creation"},
    {"version": "0.4.0", "date": "2026-01-17", "status": "completed", "summary": "Hooks package and agentplexus migration"},
    {"version": "0.5.0", "date": "2026-01-18", "status": "completed", "summary": "Module renamed to assistantkit"},
    {"version": "0.6.0", "date": "2026-01-18", "status": "completed", "summary": "Unified bundle generation for multi-tool output"},
    {"version": "0.7.0", "date": null, "status": "planned", "summary": "Settings and Rules"},
    {"version": "1.0.0", "date": null, "status": "planned", "summary": "General availability with CLI"}
  ]
}
